In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
data = {"Name": ["Shailesh", "Harsh","Shashant","Divya","Diksha","Shreya"],
        "Marks": [68, 78 , 57 , 68 , 89 , 78 ],
        "Gender": ["Male", "Male","Male", "Female","Female","Female"]}
data = pd.DataFrame(data)

In [4]:
data.head()

       Name  Marks  Gender
0  Shailesh     68    Male
1     Harsh     78    Male
2  Shashant     57    Male
3     Divya     68  Female
4    Diksha     89  Female

In [5]:
# display the top 3 rows
data.head(3)

       Name  Marks Gender
0  Shailesh     68   Male
1     Harsh     78   Male
2  Shashant     57   Male

In [6]:
# display the last 3 rows of data
data.tail(3)

     Name  Marks  Gender
3   Divya     68  Female
4  Diksha     89  Female
5  Shreya     78  Female

In [7]:
# find shape of the data set
data.shape

(6, 3)

In [8]:
# get info about the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [9]:
# check the null values
data.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
# get overall stats from the data
data.describe()

           Marks
count   6.000000
mean   73.000000
std    11.063453
min    57.000000
25%    68.000000
50%    73.000000
75%    78.000000
max    89.000000

In [11]:
# find unique values from the gendr column
data["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [12]:
# find the number of unique values in the gender col
data["Gender"].nunique()

2

In [13]:
# display count of unique values in gender col
data["Gender"].value_counts()

Male      3
Female    3
Name: Gender, dtype: int64

In [15]:
# find the number of students having marks above 70
data[data["Marks"]>=70]

     Name  Marks  Gender
1   Harsh     78    Male
4  Diksha     89  Female
5  Shreya     78  Female

In [19]:
data[data["Marks"].between(80 ,100)]

     Name  Marks  Gender
4  Diksha     89  Female

In [20]:
# find the average the marks col
data["Marks"].mean()

73.0

In [22]:
# find min marks
data["Marks"].min()

57

In [23]:
# find the max marks
data["Marks"].max()

89

### Apply method

In [24]:
def marks(x):
    return x/2

In [26]:
data["Half marks"] = data["Marks"].apply(marks)

In [27]:
data.head()

       Name  Marks  Gender  Half marks
0  Shailesh     68    Male        34.0
1     Harsh     78    Male        39.0
2  Shashant     57    Male        28.5
3     Divya     68  Female        34.0
4    Diksha     89  Female        44.5

### lambda function

In [30]:
data["Marks"].apply(lambda x: x*2)

0    136
1    156
2    114
3    136
4    178
5    156
Name: Marks, dtype: int64

In [33]:
# map function
data["Gender"]=data["Gender"].map({"Male": 1, "Female": 0})

In [35]:
data.sample(3)

       Name  Marks  Gender  Half marks
0  Shailesh     68       1        34.0
1     Harsh     78       1        39.0
5    Shreya     78       0        39.0

In [39]:
data.sort_values(by="Marks", ascending=False)

       Name  Marks  Gender  Half marks
4    Diksha     89       0        44.5
1     Harsh     78       1        39.0
5    Shreya     78       0        39.0
0  Shailesh     68       1        34.0
3     Divya     68       0        34.0
2  Shashant     57       1        28.5

In [40]:
# print columns
data.columns

Index(['Name', 'Marks', 'Gender', 'Half marks'], dtype='object')

In [44]:
# find the female students
data[data["Gender"] == 0]

     Name  Marks  Gender  Half marks
3   Divya     68       0        34.0
4  Diksha     89       0        44.5
5  Shreya     78       0        39.0

In [46]:
# find the female students only their name and marks
data[data["Gender"]==0][["Name","Marks"]]

     Name  Marks
3   Divya     68
4  Diksha     89
5  Shreya     78